In [32]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [74]:
df = {"Name" : ["Mani","Chandu","Justin","Miracle","Mani","vikram"],
        "English" : [60,80,90,60,60,48],
        "Maths" : [30,41,28,63,30,96]}
df = pd.DataFrame(df)

In [75]:
df

      Name  English  Maths
0     Mani       60     30
1   Chandu       80     41
2   Justin       90     28
3  Miracle       60     63
4     Mani       60     30
5   vikram       48     96

In [76]:
df[df.duplicated()]

   Name  English  Maths
4  Mani       60     30

In [91]:
from sklearn.preprocessing import StandardScaler
ss  =StandardScaler()
ss.fit(df[["English"]])
df["ss"] = ss.transform(df[["English"]])
print(ss.mean_)
print(ss.scale_)

[66.33333333]
[14.16176386]

In [38]:
df = pd.read_csv(r"loan.csv")

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [39]:
df.dtypes

Loan_ID               object
Gender                object
Married               object
Dependents            object
Education             object
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area         object
Loan_Status           object
dtype: object

In [43]:
(df["Dependents"].isnull().sum()/df.shape[0])*100

2.44299674267101

In [51]:
df["Dependents"].fillna(df["Dependents"].mode()[0],inplace = True)

In [57]:
df["Dependents"].value_counts()

Dependents
0    360
1    102
2    101
3     51
Name: count, dtype: int64

In [56]:
df["Dependents"].replace("3+","3",inplace = True)

In [69]:
df["Dependents"] = df["Dependents"].astype("int64")

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         614 non-null    int64
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(2), object(7)
memory usage: 62.5+ KB